export const lessons = [
  {
    id: '0',
    title: 'Основи бачати: базовий та короткий крок, звичайний поворот, базові руки',
    videoUrl: 'https://youtu.be/ZnYwxKqFO5s',
    description:
      'Вивчити базовий та короткий крок бачати, звичайний поворот та спробувати скомбінувати з базовими версіями ручок.',
    cover: '/images/covers/0.png',
  },
  {
    id: '1',
    title: 'Базові кроки та перші комбінації рук',
    videoUrl: 'https://youtu.be/-qKUn8oCTaY',
    description:
      'Розібрати матеріал та спробувати скомбінувати кроки і руки в різних поєднаннях. Відзняти два відео. Перше - приблизно 8 вісімок, тільки кроки з першого та нульового уроку в різній послідовності. Початковий рівень робить це по вісімках (одна вісімка - один крок), а середній та високий по четвірках (1-4 один крок, 5-8 - інший крок). Для високого бажано, щоб послідовність кроків була імпровізацією, але так щоб кроки не повторювались щонайменше 4 кроки підряд). Друге відео - відзняти 8 вісімок (зараз і надалі початковий рівень робить по вісімках, середній та високий по четвірках), скомбінувати кроки та руки з 1 уроку в тих поєднаннях, що вам подобаються найбільше, можна також брати кроки та руки з 0-ого уроку (але з першого мають бути присутні всі кроки і руки). Високий рівень також має додати ускладнення щонайменше на 3 вісімки.',
    cover: '/images/covers/1.png',
  },
  {
    id: '2',
    title: 'Переходимо до більш цікавих кроків та кросів, додаємо нові комбінації рук',
    videoUrl: 'https://youtu.be/KVfwuYNG2no',
    description:
      'Розібрати матеріал та спробувати скомбінувати кроки і руки в різних поєднаннях. Відзняти відео на 8 вісімок на основі нового матеріалу (також можна додавати кроки та руки з попередніх уроків), високий рівень додає ускладнення щонайменше на 3 вісімки. ',
    cover: '/images/covers/2.png',
  },
  {
    id: '3',
    title: 'Відходимо від базової класики кроків, додаємо нові комбінаціх рук',
    videoUrl: 'https://youtu.be/FHrrpCBiCJA',
    description:
      'Розібрати матеріал та спробувати скомбінувати кроки і руки в різних поєднаннях. Відзняти відео на 8 вісімок на основі нового матеріалу (також можна додавати кроки та руки з попередніх уроків), високий рівень додає ускладнення щонайменше на 3 вісімки. ',
    cover: '/images/covers/3.png',
  },
  {
    id: '4',
    title: 'Кроки-протиходи та нові комбінації рук',
    videoUrl: 'https://youtu.be/PRlDNToON8E',
    description:
      'Розібрати матеріал та спробувати скомбінувати кроки і руки в різних поєднаннях. Відзняти відео на 8 вісімок на основі нового матеріалу (також можна додавати кроки та руки з попередніх уроків). Середній та високий рівень - враховуйте, що кроки-протиходи можна поєднувати тільки з кроками протиходами на 1 вісімку. Високий рівень спочатку знімає додатково маленьке відео з усіма видами дробу, а потім використовує як окрему четвірку або вісімку (двічі) в основне відео домашньої роботи.',
    cover: '/images/covers/4.png',
  },
  {
    id: '5',
    title: 'Хвилі та пластичні кроки, нові комбінації рук',
    videoUrl: 'https://youtu.be/pZt1jiFjq0k',
    description:
      'Розібрати матеріал та спробувати скомбінувати кроки і руки в різних поєднаннях. Відзняти відео на 8 вісімок на основі нового матеріалу (також можна додавати кроки та руки з попередніх уроків). Хвилі та подібні їй кроки можна також поєднувати з кроками-протиходами, але не забувайте переносити вагу так, щоб нова вісімка починалась з правої ноги. Високий рівень спочатку знімає окреме відео тільки з кроками з 0-2 уроків (без рук) по вісімках з накладанням ускладнення (чергуєте всі три типи стегон, кожна нова вісімка - інший вид стегон, всього вісім вісімок, формат - імпровізація). Потім знімаєте основне відео та додаєте ускладнення щонайменше на 3 вісімки (по четвірках і з руками). ',
    cover: '/images/covers/5.png',
  },
  {
    id: '6',
    title: 'Повороти та остання порція комбінацій рук',
    videoUrl: 'https://youtu.be/shBts66nq6M',
    description:
      'Розібрати матеріал та спробувати скомбінувати повороти і руки в різних поєднаннях. Відзняти відео на 8 вісімок на основі нового матеріалу (початковий рівень - достатньо трьох поворотів, всі інші використовують всі. Також можна додавати кроки та руки з попередніх уроків). Високий рівень додає ускладнення на 1-2 повороти. ',
    cover: '/images/covers/6.png',
  },
]
